import datetime

fish_list=[{"名前":"タナゴ", "魚影":"極小", "売値":900, "場所":"川", "時期":"11月〜3月","時期リスト":[11,12,1,2,3], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"オイカワ","魚影":"極小", "売値":200, "場所":"川", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"フナ","魚影":"小", "売値":160, "場所":"川", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ウグイ","魚影":"中", "売値":240, "場所":"川", "時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"コイ","魚影":"大", "売値":300, "場所":"池", "時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ニシキゴイ","魚影":"大", "売値":4000, "場所":"池", "時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"キンギョ","魚影":"極小", "売値":1300, "場所":"池", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"デメキン","魚影":"極小", "売値":1300, "場所":"池", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"ランチュウ","魚影":"小", "売値":4500, "場所":"池", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"メダカ","魚影":"極小", "売値":300, "場所":"池", "時期":"4月〜8月","時期リスト":[4,5,6,7,8], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ザリガニ","魚影":"小", "売値":200, "場所":"池", "時期":"4月〜9月","時期リスト":[4,5,6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"スッポン","魚影":"中", "売値":3750, "場所":"川", "時期":"8月〜9月","時期リスト":[8,9], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"カミツキガメ","魚影":"大", "売値":5000, "場所":"川", "時期":"4月〜10月","時期リスト":[4,5,6,7,8,9,10], "時間帯":"21時〜4時","時間帯リスト":[21,22,23,0,1,2,3]},
{"名前":"オタマジャクシ","魚影":"極小", "売値":100, "場所":"池", "時期":"3月〜7月","時期リスト":[3,4,5,6,7], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"カエル","魚影":"小", "売値":120, "場所":"池", "時期":"5月〜8月","時期リスト":[5,6,7,8], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ドンコ","魚影":"小", "売値":400, "場所":"川", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"ドジョウ","魚影":"小", "売値":400, "場所":"川", "時期":"3月〜5月","時期リスト":[3,4,5], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ナマズ","魚影":"大", "売値":800, "場所":"池","時期":"5月〜10月", "時期リスト":[5,6,7,8,9,10], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"ライギョ","魚影":"大", "売値":5500, "場所":"池","時期":"6月〜8月", "時期リスト":[6,7,8], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"ブルーギル","魚影":"小", "売値":180, "場所":"川", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"イエローパーチ","魚影":"中", "売値":300, "場所":"川","時期":"10月〜3月", "時期リスト":[10,11,12,1,2,3], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ブラックバス","魚影":"大", "売値":400, "場所":"川", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ティラピア","魚影":"中", "売値":800, "場所":"川", "時期":"6月〜10月","時期リスト":[6,7,8,9,10], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"パイク","魚影":"大", "売値":1800, "場所":"川", "時期":"9月〜12月","時期リスト":[9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ワカサギ","魚影":"小", "売値":400, "場所":"川", "時期":"12月〜2月","時期リスト":[12,1,2], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"アユ","魚影":"中", "売値":900, "場所":"川", "時期":"7月〜9月","時期リスト":[7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ヤマメ","魚影":"中", "売値":1000, "場所":"崖の上", "時期":"3月〜6月、9月〜11月","時期リスト":[3,4,5,6,9,10,11], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"オオイワナ","魚影":"中", "売値":3800, "場所":"崖の上", "時期":"3月〜6月、9月〜11月","時期リスト":[3,4,5,6,9,10,11], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"ゴールデントラウト","魚影":"中", "売値":15000, "場所":"崖の上","時期":"3月〜5月、9月〜11月", "時期リスト":[3,4,5,9,10,11], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"イトウ","魚影":"特大", "売値":15000, "場所":"崖の上", "時期":"1月〜3月、12月","時期リスト":[1,2,3,12], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"サケ","魚影":"大", "売値":700, "場所":"河口", "時期":"9月","時期リスト":[9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"キングサーモン","魚影":"特大", "売値":1800, "場所":"河口","時期":"9月", "時期リスト":[9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"シャンハイガニ","魚影":"小", "売値":2000, "場所":"川","時期":"9月〜11月", "時期リスト":[9,10,11], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"グッピー","魚影":"極小", "売値":1300, "場所":"川", "時期":"4月〜11月","時期リスト":[4,5,6,7,8,9,10,11], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"ドクターフィッシュ","魚影":"小", "売値":1500, "場所":"川","時期":"5月〜9月", "時期リスト":[5,6,7,8,9], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"エンゼルフィッシュ","魚影":"小", "売値":3000, "場所":"川", "時期":"5月〜10月","時期リスト":[5,6,7,8,9,10], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"ベタ","魚影":"小", "売値":2500, "場所":"川","時期":"5月〜10月", "時期リスト":[5,6,7,8,9,10], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"ネオンテトラ","魚影":"極小", "売値":500, "場所":"川","時期":"4月〜11月", "時期リスト":[4,5,6,7,8,9,10,11], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"レインボーフィッシュ","魚影":"極小", "売値":800, "場所":"川", "時期":"5月〜10月","時期リスト":[5,6,7,8,9,10], "時間帯":"9時〜16時","時間帯リスト":[9,10,11,12,13,14,15]},
{"名前":"ピラニア","魚影":"小", "売値":2500, "場所":"川","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"9時〜16時,21時〜4時","時間帯リスト":[0,1,2,3,9,10,11,12,13,14,15,21,22,23]},
{"名前":"アロワナ","魚影":"大", "売値":10000, "場所":"川","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"ドラド","魚影":"大", "売値":15000, "場所":"川","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"4時〜21時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},
{"名前":"ガー","魚影":"特大", "売値":6000, "場所":"池", "時期":"6月〜9月","時期リスト":[6,7,8,9], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"ピラルク","魚影":"特大", "売値":10000, "場所":"川","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"エンドリケリー","魚影":"大", "売値":4000, "場所":"川","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"21時〜4時","時間帯リスト":[21,22,23,0,1,2,3]},
{"名前":"チョウザメ","魚影":"特大", "売値":10000, "場所":"河口", "時期":"1月〜3月、9月〜12月","時期リスト":[1,2,3,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"クリオネ","魚影":"極小", "売値":1000, "場所":"海", "時期":"12月〜3月","時期リスト":[12,1,2,3], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"タツノオトシゴ","魚影":"極小", "売値":1100, "場所":"海", "時期":"4月〜11月","時期リスト":[4,5,6,7,8,9,10,11], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"クマノミ","魚影":"極小", "売値":650, "場所":"海","時期":"4月〜9月", "時期リスト":[4,5,6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ナンヨウハギ","魚影":"小", "売値":1000, "場所":"海","時期":"4月〜9月", "時期リスト":[4,5,6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"チョウチョウウオ","魚影":"小", "売値":1000, "場所":"海", "時期":"4月〜9月","時期リスト":[4,5,6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ナポレオンフィッシュ","魚影":"特大", "売値":10000, "場所":"海","時期":"7月〜8月", "時期リスト":[7,8], "時間帯":"4時〜21時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},
{"名前":"ミノカサゴ","魚影":"中", "売値":500, "場所":"海","時期":"4月〜11月", "時期リスト":[4,5,6,7,8,9,10,11], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"フグ","魚影":"中", "売値":5000, "場所":"海", "時期":"11月〜2月","時期リスト":[11,12,1,2], "時間帯":"21時〜4時","時間帯リスト":[21,22,23,0,1,2,3]},
{"名前":"ハリセンボン","魚影":"中", "売値":250, "場所":"海","時期":"7月〜9月", "時期リスト":[7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"アンチョビ","魚影":"小", "売値":200, "場所":"海", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"4時〜21時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},
{"名前":"アジ","魚影":"小", "売値":150, "場所":"海", "時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"イシダイ","魚影":"中", "売値":5000, "場所":"海","時期":"3月〜11月", "時期リスト":[3,4,5,6,7,8,9,10,11], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"スズキ","魚影":"大", "売値":400, "場所":"海", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"タイ","魚影":"中", "売値":3000, "場所":"海", "時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"カレイ","魚影":"中", "売値":300, "場所":"海", "時期":"10月〜4月","時期リスト":[10,11,12,1,2,3,4], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ヒラメ","魚影":"大", "売値":800, "場所":"海", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"イカ","魚影":"中", "売値":500, "場所":"海", "時期":"12月〜8月","時期リスト":[12,1,2,3,4,5,6,7,8], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ウツボ","魚影":"ほそなが", "売値":2000, "場所":"海", "時期":"8月〜10月","時期リスト":[8,9,10], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ハナヒゲウツボ","魚影":"ほそなが", "売値":600, "場所":"海","時期":"6月〜10月", "時期リスト":[6,7,8,9,10], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"マグロ","魚影":"特大", "売値":7000, "場所":"桟橋","時期":"1月〜4月、11月〜12月", "時期リスト":[1,2,3,4,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"カジキ","魚影":"特大", "売値":10000, "場所":"桟橋", "時期":"1月〜4月、7月〜9月、11月〜12月","時期リスト":[1,2,3,4,7,8,9,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ロウニンアジ","魚影":"大", "売値":4500, "場所":"桟橋","時期":"5月〜10月", "時期リスト":[5,6,7,8,9,10], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"シイラ","魚影":"特大", "売値":6000, "場所":"桟橋", "時期":"5月〜10月","時期リスト":[5,6,7,8,9,10], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"マンボウ","魚影":"背びれ", "売値":4000, "場所":"海","時期":"7月〜9月", "時期リスト":[7,8,9], "時間帯":"4時〜21時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},
{"名前":"エイ","魚影":"大", "売値":3000, "場所":"海","時期":"8月〜11月", "時期リスト":[8,9,10,11], "時間帯":"4時〜21時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20]},
{"名前":"ノコギリザメ","魚影":"背びれ", "売値":12000, "場所":"海","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"シュモクザメ","魚影":"背びれ", "売値":8000, "場所":"海","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"サメ","魚影":"背びれ", "売値":15000, "場所":"海","時期":"6月〜9月", "時期リスト":[6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ジンベエザメ","魚影":"背びれ", "売値":13000, "場所":"海", "時期":"6月〜9月","時期リスト":[6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"コバンザメ","魚影":"背びれ", "売値":1500, "場所":"海", "時期":"6月〜9月","時期リスト":[6,7,8,9], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"チョウチンアンコウ","魚影":"大", "売値":2500, "場所":"海", "時期":"11月〜3月","時期リスト":[11,12,1,2,3], "時間帯":"16時〜9時","時間帯リスト":[16,17,18,19,20,21,22,23,0,1,2,3,4,5,6,7,8]},
{"名前":"リュウグウノツカイ","魚影":"特大", "売値":9000, "場所":"海","時期":"12月〜5月", "時期リスト":[12,1,2,3,4,5], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"デメニギス","魚影":"小", "売値":15000, "場所":"海", "時期":"いつでも","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"21時〜4時","時間帯リスト":[21,22,23,0,1,2,3]},
{"名前":"シーラカンス","魚影":"特大", "売値":15000, "場所":"海", "時期":"いつでも（雨の日、離島では晴れでも釣れる）","時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12], "時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]}]

insect_list=[{"名前":"モンシロチョウ", "売値":160, "場所":"空中","時期":"1月〜6月,9月〜12月", "時期リスト":[1,2,3,4,5,6,9,10,11,12],"時間帯":"4〜19時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"モンキチョウ", "売値":160, "場所":"空中","時期":"3月〜6月,9月〜10月", "時期リスト":[3,4,5,6,9,10],"時間帯":"4〜19時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"アゲハチョウ", "売値":240, "場所":"空中","時期":"3月〜9月", "時期リスト":[3,4,5,6,7,8,9],"時間帯":"4〜19時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"カラスアゲハ", "売値":2500, "場所":"花","時期":"3月〜6月", "時期リスト":[3,4,5,6],"時間帯":"4〜19時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"アオスジアゲハ", "売値":300, "場所":"空中","時期":"4月〜8月", "時期リスト":[4,5,6,7,8],"時間帯":"4〜19時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"オオゴマダラ", "売値":1000, "場所":"花","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"オオムラサキ", "売値":3000, "場所":"花","時期":"5月〜8月", "時期リスト":[5,6,7,8],"時間帯":"4〜19時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"オオカバマダラ", "売値":140, "場所":"花","時期":"9月〜11月", "時期リスト":[9,10,11],"時間帯":"4〜17時","時間帯リスト":[4,5,6,7,8,9,10,11,12,13,14,15,16]},
{"名前":"モルフォチョウ", "売値":4000, "場所":"花","時期":"12月〜3月,6月〜9月", "時期リスト":[12,1,2,3,6,7,8,9],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"ミイロタテハ", "売値":3000, "場所":"花","時期":"4月〜9月", "時期リスト":[4,5,6,7,8,9],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"アカエリトリバネアゲハ", "売値":2500, "場所":"花","時期":"12月〜2月,4月〜9月", "時期リスト":[12,1,2,4,5,6,7,8,9],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"アレキサンドラトリバネアゲハ", "売値":4000, "場所":"花","時期":"5月〜9月", "時期リスト":[5,6,7,8,9],"時間帯":"8〜16時","時間帯リスト":[8,9,10,11,12,13,14,15]},
{"名前":"ガ", "売値":130, "場所":"外灯","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"0〜4時、19〜24時","時間帯リスト":[0,1,2,3,19,20,21,22,23]},
{"名前":"ヨナグニサン", "売値":3000, "場所":"広葉樹、針葉樹、ヤシの木","時期":"4月〜9月", "時期リスト":[4,5,6,7,8,9],"時間帯":"0〜4時、19〜24時","時間帯リスト":[0,1,2,3,19,20,21,22,23]},
{"名前":"ニシキオオツバメガ", "売値":2500, "場所":"花","時期":"4月〜9月", "時期リスト":[4,5,6,7,8,9],"時間帯":"8〜16時","時間帯リスト":[8,9,10,11,12,13,14,15]},
{"名前":"ショウリョウバッタ", "売値":200, "場所":"地面","時期":"4月〜11月", "時期リスト":[4,5,6,7,8,9,10,11],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"トノサマバッタ", "売値":600, "場所":"地面","時期":"8月〜11月", "時期リスト":[8,9,10,11],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"イナゴ", "売値":400, "場所":"地面","時期":"8月〜11月", "時期リスト":[8,9,10,11],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"キリギリス", "売値":160, "場所":"地面","時期":"7月〜9月", "時期リスト":[7,8,9],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"コオロギ", "売値":130, "場所":"地面","時期":"9月〜11月", "時期リスト":[9,10,11],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"スズムシ", "売値":430, "場所":"地面","時期":"9月〜10月", "時期リスト":[9,10],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"カマキリ", "売値":430, "場所":"花","時期":"3月〜11月", "時期リスト":[3,4,5,6,7,8,9,10,11],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ハナカマキリ", "売値":2400, "場所":"花","時期":"3月〜11月", "時期リスト":[3,4,5,6,7,8,9,10,11],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ミツバチ", "売値":200, "場所":"花","時期":"3月〜7月", "時期リスト":[3,4,5,6,7],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ハチ", "売値":2500, "場所":"広葉樹、針葉樹","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"アブラゼミ", "売値":250, "場所":"広葉樹、針葉樹","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ミンミンゼミ", "売値":300, "場所":"広葉樹、針葉樹","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"クマゼミ", "売値":500, "場所":"広葉樹、針葉樹","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ツクツクホウシ", "売値":400, "場所":"広葉樹、針葉樹","時期":"8月〜9月", "時期リスト":[8,9],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ヒグラシ", "売値":550, "場所":"広葉樹、針葉樹","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"4〜8時、16〜19時","時間帯リスト":[4,5,6,7,16,17,18]},
{"名前":"セミのぬけがら", "売値":10, "場所":"広葉樹、針葉樹","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"アキアカネ", "売値":180, "場所":"空中","時期":"9月〜10月", "時期リスト":[9,10],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"ギンヤンマ", "売値":230, "場所":"空中","時期":"4月〜10月", "時期リスト":[4,5,6,7,8,9,10],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"オニヤンマ", "売値":4500, "場所":"空中","時期":"5月〜10月", "時期リスト":[5,6,7,8,9,10],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"イトトンボ", "売値":500, "場所":"空中","時期":"11月〜2月", "時期リスト":[11,12,1,2],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ホタル", "売値":300, "場所":"池、川","時期":"6月", "時期リスト":[6],"時間帯":"0〜4時 19〜24時","時間帯リスト":[0,1,2,3,19,20,21,22,23]},
{"名前":"オケラ", "売値":500, "場所":"地面","時期":"1月〜5月,11月〜12月", "時期リスト":[1,2,3,4,5,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"アメンボ", "売値":130, "場所":"池、","時期":"5月〜9月", "時期リスト":[5,6,7,8,9],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"ゲンゴロウ", "売値":800, "場所":"池、川","時期":"5月〜9月", "時期リスト":[5,6,7,8,9],"時間帯":"8〜19時","時間帯リスト":[8,9,10,11,12,13,14,15,16,17,18]},
{"名前":"タガメ", "売値":2000, "場所":"池、川","時期":"4月〜9月", "時期リスト":[4,5,6,7,8,9],"時間帯":"0〜8時、19〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,19,20,21,22,23]},
{"名前":"カメムシ", "売値":120, "場所":"花","時期":"3月〜10月", "時期リスト":[3,4,5,6,7,8,9,10],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ジンメンカメムシ", "売値":1000, "場所":"花","時期":"3月〜10月", "時期リスト":[3,4,5,6,7,8,9,10],"時間帯":"0〜8時、19〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,19,20,21,22,23]},
{"名前":"テントウムシ", "売値":200, "場所":"花","時期":"3月〜6月,10月", "時期リスト":[3,4,5,6,10],"時間帯":"8〜17時","時間帯リスト":[8,9,10,11,12,13,14,15,16]},
{"名前":"ハンミョウ", "売値":1500, "場所":"地面","時期":"2月〜10月", "時期リスト":[2,3,4,5,6,7,8,9,10],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"タマムシ", "売値":2400, "場所":"切株","時期":"4月〜8月", "時期リスト":[4,5,6,7,8],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"バイオリンムシ", "売値":450, "場所":"切株","時期":"5月〜6月,9月〜11月", "時期リスト":[5,6,9,10,11],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ゴマダラカミキリ", "売値":350, "場所":"切株","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ルリボシカミキリ", "売値":3000, "場所":"切株","時期":"5月〜9月", "時期リスト":[5,6,7,8,9],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ホウセキゾウムシ", "売値":800, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"フンコロガシ", "売値":3000, "場所":"雪玉の下","時期":"1月〜2月,12月", "時期リスト":[12,1,2],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"オオセンチコガネ", "売値":300, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜9月", "時期リスト":[7,8,9],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"プラチナコガネ", "売値":10000, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、23〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,23]},
{"名前":"カナブン", "売値":200, "場所":"広葉樹、針葉樹、ヤシの木","時期":"6月〜8月", "時期リスト":[6,7,8],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ゴライアスオオツノハナムグリ", "売値":8000, "場所":"ヤシの木","時期":"6月〜9月", "時期リスト":[6,7,8,9],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"ノコギリクワガタ", "売値":2000, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ミヤマクワガタ", "売値":1000, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"オオクワガタ", "売値":10000, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、23〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,23]},
{"名前":"ニジイロクワガタ", "売値":6000, "場所":"広葉樹、針葉樹、ヤシの木","時期":"6月〜9月", "時期リスト":[6,7,8,9],"時間帯":"0〜8時、19〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,19,20,21,22,23]},
{"名前":"ホソアカクワガタ", "売値":8000, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"オウゴンオニクワガタ", "売値":12000, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"ギラファノコギリクワガタ", "売値":12000, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"カブトムシ", "売値":1350, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"コーカサスオオカブト", "売値":8000, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"ゾウカブト", "売値":8000, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"ヘラクレスオオカブト", "売値":12000, "場所":"ヤシの木","時期":"7月〜8月", "時期リスト":[7,8],"時間帯":"0〜8時、17〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,17,18,19,20,21,22,23]},
{"名前":"ナナフシ", "売値":600, "場所":"広葉樹、針葉樹、ヤシの木","時期":"7月〜11月", "時期リスト":[7,8,9,10,11],"時間帯":"4〜8時、17〜19時","時間帯リスト":[4,5,6,7,17,18]},
{"名前":"コノハムシ", "売値":600, "場所":"地面","時期":"7月〜9月", "時期リスト":[7,8,9],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ミノムシ", "売値":600, "場所":"広葉樹、針葉樹","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"アリ", "売値":80, "場所":"腐ったカブ","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ヤドカリ", "売値":1000, "場所":"砂浜","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"0〜8時、19〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,19,20,21,22,23]},
{"名前":"フナムシ", "売値":200, "場所":"海岸岩場","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ハエ", "売値":60, "場所":"タイヤ、空き缶、長靴、腐ったカブ","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"カ", "売値":130, "場所":"空中","時期":"6月〜9月", "時期リスト":[6,7,8,9],"時間帯":"0〜4時、17〜24時","時間帯リスト":[0,1,2,3,17,18,19,20,21,22,23]},
{"名前":"ノミ", "売値":70, "場所":"住民についてる","時期":"4月〜11月", "時期リスト":[4,5,6,7,8,9,10,11],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"カタツムリ", "売値":250, "場所":"岩","時期":"いつでも(雨の日)", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"いつでも","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]},
{"名前":"ダンゴムシ", "売値":250, "場所":"岩","時期":"1月〜6月,9月〜12月", "時期リスト":[1,2,3,4,5,6,9,10,11,12],"時間帯":"0〜16時、23〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,23]},
{"名前":"ムカデ", "売値":300, "場所":"岩","時期":"1月〜6月,9月〜12月", "時期リスト":[1,2,3,4,5,6,9,10,11,12],"時間帯":"16〜23時","時間帯リスト":[16,17,18,19,20,21,22]},
{"名前":"クモ", "売値":600, "場所":"広葉樹、針葉樹","時期":"いつでも", "時期リスト":[1,2,3,4,5,6,7,8,9,10,11,12],"時間帯":"0〜8時、19〜24時","時間帯リスト":[0,1,2,3,4,5,6,7,19,20,21,22,23]},
{"名前":"タランチュラ", "売値":8000, "場所":"地面","時期":"1月〜4月,11月〜12月", "時期リスト":[1,2,3,4,11,12],"時間帯":"0〜4時、19〜24時","時間帯リスト":[0,1,2,3,19,20,21,22,23]},
{"名前":"サソリ", "売値":8000, "場所":"地面","時期":"5月〜10月", "時期リスト":[5,6,7,8,9,10],"時間帯":"0〜4時、19〜24時","時間帯リスト":[0,1,2,3,19,20,21,22,23]}]

dic_count={}
dic_type={}
fish_class={0:"名前",1:"魚影",2:"売値",3:"場所",4:"時期",5:"時間帯"}
insect_class={0:"名前",1:"売値",2:"場所",3:"時期",4:"時間帯"}

print("1 サカナ\n2 ムシ")
trg=int(input("数字を入れてください："))
if trg==1:
    date=datetime.datetime.now()
    print("0 {0}月{1}日{2}時{3}分現在釣れるサカナ\n1 サカナについて知りたい\n2 時期ごとに釣れるサカナを検索\n3 今月初めて釣れるサカナ\n4 来月釣れなくなるサカナ".format(date.month,date.day,date.hour,date.minute))
    task=int(input("数字を入れてください："))

    if task==0:
        date=datetime.datetime.now()
        for i in range(len(fish_list)):
            if (date.month in fish_list[i]["時期リスト"])&(date.hour in fish_list[i]["時間帯リスト"]):
                if fish_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                    dic_count[fish_list[i]["場所"]]+=1
                    dic_type[fish_list[i]["場所"]].append(i)
                else:
                    dic_count[fish_list[i]["場所"]]=1
                    dic_type[fish_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)
        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<10} | 場所：{1:　<3} | 魚影：{2:　<2} | 売値：{3}".format(fish_list[num]["名前"],fish_list[num]["場所"],fish_list[num]["魚影"],fish_list[num]["売値"]))
            print("---")

    elif task==1:
        fish_name=input("サカナの名前をカタカナで入力してください：")
        count=0
        index=-1
        for i in range(len(fish_list)):
            if fish_name == fish_list[i]["名前"]:
                count+=1
                index=i
        if count==0:
            print("その名前のサカナは存在しません")
            exit()
        print("0 すべて\n1 魚影の大きさ\n2 売ったときの値段\n3 出現する場所\n4 出現する時期\n5 出現する時間帯")
        fish_detail=int(input("どれを知りたいか数字で入力してください："))
        if not 0<=fish_detail<=5:
            print("正しく入力してください")
            exit()

        if 1<=fish_detail<=5:
            print(fish_list[index][fish_class[fish_detail]])
        else:
            for i in range(6):
                print("【{}】".format(fish_class[i]))
                print(fish_list[index][fish_class[i]])

    elif task==2:
        month_num=int(input("何月ですか？数字を入れてください："))
        if not 1<=month_num<=12:
            print("正しい数字を入れてください")
            exit()
        for i in range(len(fish_list)):
            if month_num in fish_list[i]["時期リスト"]:
                if fish_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                    dic_count[fish_list[i]["場所"]]+=1
                    dic_type[fish_list[i]["場所"]].append(i)
                else:
                    dic_count[fish_list[i]["場所"]]=1
                    dic_type[fish_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)
        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<10} | 場所：{1:　<3} | 魚影：{2:　<2} | 売値：{3: <5} | 時間帯：{4}".format(fish_list[num]["名前"],fish_list[num]["場所"],fish_list[num]["魚影"],fish_list[num]["売値"],fish_list[num]["時間帯"]))
            print("---")

    elif task==3:
        this_month_num=int(input("今月は何月ですか？数字を入れてください："))
        if not 1<=this_month_num<=12:
            print("正しい数字を入れてください")
            exit()
        last_month_num=this_month_num-1
        if last_month_num==0:
            last_month_num=12
        for i in range(len(fish_list)):
            if this_month_num in fish_list[i]["時期リスト"]:
                if last_month_num not in fish_list[i]["時期リスト"]:
                    if fish_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                        dic_count[fish_list[i]["場所"]]+=1
                        dic_type[fish_list[i]["場所"]].append(i)
                    else:
                        dic_count[fish_list[i]["場所"]]=1
                        dic_type[fish_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)
        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<10} | 場所：{1:　<3} | 魚影：{2:　<2} | 売値：{3}".format(fish_list[num]["名前"],fish_list[num]["場所"],fish_list[num]["魚影"],fish_list[num]["売値"]))
            print("---")

    elif task==4:
        this_month_num=int(input("今月は何月ですか？数字を入れてください："))
        if not 1<=this_month_num<=12:
            print("正しい数字を入れてください")
            exit()
        next_month_num=this_month_num+1
        if next_month_num==13:
            next_month_num=1
        for i in range(len(fish_list)):
            if this_month_num in fish_list[i]["時期リスト"]:
                if next_month_num not in fish_list[i]["時期リスト"]:
                    if fish_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                        dic_count[fish_list[i]["場所"]]+=1
                        dic_type[fish_list[i]["場所"]].append(i)
                    else:
                        dic_count[fish_list[i]["場所"]]=1
                        dic_type[fish_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)
        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<10} | 場所：{1:　<3} | 魚影：{2:　<2} | 売値：{3}".format(fish_list[num]["名前"],fish_list[num]["場所"],fish_list[num]["魚影"],fish_list[num]["売値"]))
            print("---")
    else:
        print("正しく入力してください")


elif trg==2:
    date=datetime.datetime.now()
    print("0 {0}月{1}日{2}時{3}分現在とれるムシ\n1 ムシについて知りたい\n2 時期ごとにムシを検索\n3 今月初めてとれるムシ\n4 来月とれなくなるムシ".format(date.month,date.day,date.hour,date.minute))
    task=int(input("数字を入れてください："))

    if task==0:
        date=datetime.datetime.now()
        for i in range(len(insect_list)):
            if (date.month in insect_list[i]["時期リスト"])&(date.hour in insect_list[i]["時間帯リスト"]):
                if insect_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                    dic_count[insect_list[i]["場所"]]+=1
                    dic_type[insect_list[i]["場所"]].append(i)
                else:
                    dic_count[insect_list[i]["場所"]]=1
                    dic_type[insect_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)
        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<14} | 場所：{1:　<16} | 売値：{2}".format(insect_list[num]["名前"],insect_list[num]["場所"],insect_list[num]["売値"]))
            print("---")

    elif task==1:
        insect_name=input("ムシの名前をカタカナで入力してください：")
        count=0
        index=-1
        for i in range(len(insect_list)):
            if insect_name == insect_list[i]["名前"]:
                count+=1
                index=i
        if count==0:
            print("その名前のムシは存在しません")
            exit()
        print("0 すべて\n1 売ったときの値段\n2 出現する場所\n3 出現する時期\n4 出現する時間帯")
        insect_detail=int(input("どれを知りたいか数字で入力してください："))
        if not 0<=insect_detail<=4:
            print("正しく入力してください")
            exit()

        if 1<=insect_detail<=4:
            print(insect_list[index][insect_class[insect_detail]])
        else:
            for i in range(5):
                print("【{}】".format(insect_class[i]))
                print(insect_list[index][insect_class[i]])

    elif task==2:
        month_num=int(input("何月ですか？数字を入れてください："))
        if not 1<=month_num<=12:
            print("正しい数字を入れてください")
            exit()
        for i in range(len(insect_list)):
            if month_num in insect_list[i]["時期リスト"]:
                if insect_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                    dic_count[insect_list[i]["場所"]]+=1
                    dic_type[insect_list[i]["場所"]].append(i)
                else:
                    dic_count[insect_list[i]["場所"]]=1
                    dic_type[insect_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)
        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<14} | 場所：{1:　<16} | 売値：{2: <5} | 時間帯：{3}".format(insect_list[num]["名前"],insect_list[num]["場所"],insect_list[num]["売値"],insect_list[num]["時間帯"]))
            print("---")

    elif task==3:
        this_month_num=int(input("今月は何月ですか？数字を入れてください："))
        if not 1<=this_month_num<=12:
            print("正しい数字を入れてください")
            exit()
        last_month_num=this_month_num-1
        if last_month_num==0:
            last_month_num=12

        for i in range(len(insect_list)):
            if this_month_num in insect_list[i]["時期リスト"]:
                if last_month_num not in insect_list[i]["時期リスト"]:
                    if insect_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                        dic_count[insect_list[i]["場所"]]+=1
                        dic_type[insect_list[i]["場所"]].append(i)
                    else:
                        dic_count[insect_list[i]["場所"]]=1
                        dic_type[insect_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)

        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<14} | 場所：{1:　<16} | 売値：{2: <5} | 時間帯：{3}".format(insect_list[num]["名前"],insect_list[num]["場所"],insect_list[num]["売値"],insect_list[num]["時間帯"]))
            print("---")

    elif task==4:
        this_month_num=int(input("今月は何月ですか？数字を入れてください："))
        if not 1<=this_month_num<=12:
            print("正しい数字を入れてください")
            exit()
        next_month_num=this_month_num+1
        if next_month_num==13:
            next_month_num=1

        for i in range(len(insect_list)):
            if this_month_num in insect_list[i]["時期リスト"]:
                if next_month_num not in insect_list[i]["時期リスト"]:
                    if insect_list[i]["場所"] in dic_type:#以下、出現回数が多い場所順にソート
                        dic_count[insect_list[i]["場所"]]+=1
                        dic_type[insect_list[i]["場所"]].append(i)
                    else:
                        dic_count[insect_list[i]["場所"]]=1
                        dic_type[insect_list[i]["場所"]]=[i]
        dic_count_sorted=sorted(dic_count.items(), key=lambda x:x[1], reverse=True)

        for i in range(len(dic_count_sorted)):
            for num in dic_type[dic_count_sorted[i][0]]:
                print("{0:　<14} | 場所：{1:　<16} | 売値：{2: <5} | 時間帯：{3}".format(insect_list[num]["名前"],insect_list[num]["場所"],insect_list[num]["売値"],insect_list[num]["時間帯"]))
            print("---")

    else:
        print("正しく入力してください")


else:
    print("正しく入力してください")